{
    "results": 10,
    "data": [
      {
        "id": 286574,
        "name": "Sacramento Northern Rail Trail",
        "url": "https://www.singletracks.com/bike-trails/sacramento-northern-rail-trail/",
        "length": "11.0",
        "description": "8 Miles of Class A paved bike path with several road crossings. When the pavement ends it becomes single track for another 3-5 miles.",
        "directions": "In Sacramento the Trailhead is next to Blue Diamond Almonds at 1900 C Street.",
        "city": "Sacramento",
        "region": "California",
        "country": "United States",
        "lat": "38.58480",
        "lon": "-121.47704",
        "difficulty": "",
        "features": "",
        "rating": 0,
        "thumbnail": "https://images.singletracks.com/blog/wp-content/uploads/2007/04/2016-1181653082-orig.jpg"
      },
      {
        "id": 277038,
        "name": "Township 9 Bike Park",
        "url": "https://www.singletracks.com/bike-trails/township-9-bike-park/",
        "length": "1.0",
        "description": "The park has beginner, intermediate and advance jump lines. There is also a cross country approx. 1/2 mile in length.",
        "directions": "900 North 7th Street<br />\r\nSacramento&#8206; CA<br />\r\nUnited States",
        "city": "Sacramento",
        "region": "California",
        "country": "United States",
        "lat": "38.60014",
        "lon": "-121.49085",
        "difficulty": "Beginner",
        "features": "Fat biking allowed in winter, Pump track, Restrooms",
        "rating": 5,
        "thumbnail": "https://images.singletracks.com/blog/wp-content/uploads/2015/11/imagejpeg83993-orig-scaled.jpg"
      },
      {
        "id": 288838,
        "name": "American River Trail",
        "url": "https://www.singletracks.com/bike-trails/american-river-bike-trail/",
        "length": "32.0",
        "description": "As stated above, the singletrack options along this trail are not legally open, yet many people have been known to partake in this option.  I was once asked by a park ranger to get off the doubletrack trail.  He was in his truck at the time so I didn't take his warning too seriously.  Now if he had been on a bike, that might have been different.  But a truck!!  In an area closed to motor vehicles!?!?!  I don't think so!!  That being aside, I would suggest that any off-pavement excursions be kept to a minimum and courtesy should remain a paradigm to trail riding here.  Keep in mind that some trails are posted as \"No Bikes\" while others are not.  A bit odd, but so be it.  The trail itself is easy to follow as it is paved, but as stated earlier you can turn around at any point.  There are numerous rest stops, drinking fountains, picnic spots and whatnot along the trail so \"fun events\" are always a possibility.  You may encounter equestrians, joggers, dog walkers, skaters and young families; so exercise caution.  A hearty \"hello\" or \"passing on your left\" is always courteous.  Posted speed limit along the trail is 15mph so watch yourself.  Usually this is not too much of a problem, but every once in awhile an inattentive jogger, cyclist or child can cause disaster.   Total elevation change is 440 feet over the 32 miles, however most of those feet come in the final grunt up to Folsom Lake in the last two miles.  The lower 30 miles are flat.   Since this is a paved trail it is open year-round however summertime temperatures can be into the low 100s, so plan accordingly.  Spring and fall tend to be the most popular seasons, but any weekend can see lots of activity along this trail.",
        "directions": "Starting at the confluence of the American and Sacramento Rivers, this trail heads east to Folsom Lake.  The total distance (one-way) is 32 miles.  You can ride any distance since it is an out and back ride. There is currently no \"legal'\"singletrack along this route, however that is under review within the Parks & Rec departments that oversee the Trail.  However, you may be able to divert from the paved path up to the levees along the American River to get some dirt under your tires.  The path on top of the levee is legal to ride on.",
        "city": "Sacramento",
        "region": "California",
        "country": "United States",
        "lat": "38.60094",
        "lon": "-121.50776",
        "difficulty": "Beginner",
        "features": "",
        "rating": 2.83,
        "thumbnail": "https://images.singletracks.com/blog/wp-content/uploads/2002/12/70-1226534776-orig.jpg"
      },
      {
        "id": 274376,
        "name": "O",
        "url": "https://www.singletracks.com/?post_type=bike-trails&p=274376",
        "length": "0.0",
        "description": "",
        "directions": "",
        "city": "",
        "region": "California",
        "country": "United States",
        "lat": "38.68598",
        "lon": "-121.33631",
        "difficulty": "Intermediate",
        "features": "Restrooms",
        "rating": 3,
        "thumbnail": "https://images.singletracks.com/blog/wp-content/uploads/2018/02/27605699_1208607639275112_10187634_o-orig-scaled.jpg"
      },
      {
        "id": 286554,
        "name": "Folsom South Canal",
        "url": "https://www.singletracks.com/bike-trails/folsom-south-canal/",
        "length": "16.0",
        "description": "Class A paved bike path with a few road crossings and no speed limit. Great for high speed road training rides.",
        "directions": "Start at Sac State Aquatic Center, 1901 Hazel Ave. Rancho Cordova, CA",
        "city": "Sacramento",
        "region": "California",
        "country": "United States",
        "lat": "38.63310",
        "lon": "-121.22222",
        "difficulty": "Easiest",
        "features": "",
        "rating": 5,
        "thumbnail": "https://images.singletracks.com/blog/wp-content/uploads/2007/05/2036-1179671838-orig.jpg"
      },
      {
        "id": 286575,
        "name": "Lake Natoma Loop",
        "url": "https://www.singletracks.com/bike-trails/lake-natoma-loop/",
        "length": "13.0",
        "description": "2/3 singletrack, 1/3 Class A paved bike path with two road crossings along the route. Mild hills all along the route. Go clockwise for mostly downhill.",
        "directions": "From Sacramento: Get on Folsom Blvd. and head East to the end. If you cross the river, you just passed it. Trailhead is next to the Light Rail Station. ",
        "city": "Folsom",
        "region": "California",
        "country": "United States",
        "lat": "38.63484",
        "lon": "-121.21850",
        "difficulty": "Beginner",
        "features": "Night riding allowed",
        "rating": 4,
        "thumbnail": "https://images.singletracks.com/blog/wp-content/uploads/2009/02/lakenatomas-009-0-orig.jpg"
      },
      {
        "id": 285764,
        "name": "Hazel to Granite Bay",
        "url": "https://www.singletracks.com/bike-trails/hazel-2-granite-bay/",
        "length": "31.0",
        "description": "Head east on bike American River bike path, just passed kiosk will be single track, it will criss cross pavement, if there is not any trail just keep it on the dirt on either side. Go under the new Folsom bridge make a right, climb to bridge, cross bridge headed north. \r\nOther end of the bridge turn right, go down to bike path, go left toward dam, single track runs willy nilly on the way to Beal Point passed dam. Head toward Granite Bay on fire road. There is single track so snoop around, fire trail will take you to Granite Bay. \r\nAt Granite Bay there are many choices so do yours, I at least do first hill. Ride ranges from 27 to 38 miles",
        "directions": "Park at the Hazel parking north side of hwy 50",
        "city": "Folsom",
        "region": "California",
        "country": "United States",
        "lat": "38.63445",
        "lon": "-121.22019",
        "difficulty": "Intermediate",
        "features": "Night riding allowed",
        "rating": 5,
        "thumbnail": "https://images.singletracks.com/blog/wp-content/uploads/2014/10/G003668658147-orig.jpg"
      },
      {
        "id": 286996,
        "name": "Prairie City Off Road Park",
        "url": "https://www.singletracks.com/bike-trails/prairie-city-off-road-park/",
        "length": "40.0",
        "description": "Early April till late June the park is closed to moterized vehicles on Wednesday's evening's. This is the only time we came ride there on the single track and double track mostly. RaceMTB.com holds races which are fun and easy going and are the reason we can us the property Wednesday night's. As long as you stay out of the way and are out by 8:00 p.m. it's all good.",
        "directions": "Prairie City Road off of I-80 southeast to Grantline Road then about a mile West to main entrance",
        "city": "Folsom",
        "region": "California",
        "country": "United States",
        "lat": "38.59784",
        "lon": "-121.15180",
        "difficulty": "",
        "features": "",
        "rating": 4,
        "thumbnail": "https://images.singletracks.com/blog/wp-content/uploads/2006/03/1146789332-orig-1.jpg"
      },
      {
        "id": 275093,
        "name": "John A. Milne/Gutierrez Canyon Open Space",
        "url": "https://www.singletracks.com/bike-trails/john-a-milne-gutierrez-canyon-open-space/",
        "length": "5.0",
        "description": "This is a fairly small network with a few loop opportunities along the ridges and valleys on the east side of Cedar Crest.  Some trails are more well defined than others and it may take a couple rides to explore the possibilities.  Most of the network is beginner friendly, but there are a few spooky spots for a new rider.  The climbs are short, but sharp in places.",
        "directions": "From Albuquerque, go East on I-40 and take the exit for highway 14 North to Cedar Crest.  Go about 2.5 miles and park in the large lot just south of the post office.",
        "city": "Cedar Crest",
        "region": "New Mexico",
        "country": "United States",
        "lat": "35.12940",
        "lon": "-106.36566",
        "difficulty": "Intermediate",
        "features": "",
        "rating": 3.5,
        "thumbnail": null
      },
      {
        "id": 287747,
        "name": "Old Folsom To Granite Bay",
        "url": "https://www.singletracks.com/bike-trails/old-folsom-to-granite-bay/",
        "length": "21.0",
        "description": "Good beginner/intermediate type of ride that never strays far from civilization. Starting point is at the Rainbow Bridge near Old Folsom at which point you'll cross the bridge and head north on the American River Bike trail. A dirt path will immediately veer off to the right to reveal some nice single track. It will weave on and off the paved trail and eventually end as you make the climb up to Beals Point on the pavement. In the map above (referring to my website), the red trail represents the dirt/off road and the yellow trail is pavement. Continuing on, the trail will hug the side of the lake turning to gravel then dirt by the time you reach 5th camera up. At the six mile mark you'll reach the park and boat ramps. There are some single track trails off to the left. Eventually the trails will head off to the west where there are many interlocking single track trails. There really is no right or wrong way to go. I didn't even hit all of them on this ride. Pretty safe to explore as they don't stray away from this general area...you just can't get any further without hiking. This time of year (spring) some of the trails were under water as the 8th pic up shows. You could also drive to Granite Bay or Beals Point as starting point for shorter rides.\r\n\r\n  \r\n",
        "directions": "Hwy 50 to Folsom Blvd exit.  Head north until you cross the bridge then take the next right (Greenback).  Cross the small bridge and look for parking on the right side of the street.",
        "city": "Folsom",
        "region": "California",
        "country": "United States",
        "lat": "38.67735",
        "lon": "-121.18044",
        "difficulty": "Intermediate",
        "features": "",
        "rating": 3,
        "thumbnail": "https://images.singletracks.com/blog/wp-content/uploads/2017/08/Ride-orig.jpg"
      }
    ]
  }